package main

import (
	"fmt"
	"math"
)

func main() {
	// Одне яблуко коштує 5.99 грн. Ціна однієї груші - 7 грн.
	// Ми маємо 23 грн.
	// 1. Скільки грошей треба витратити, щоб купити 9 яблук та 8 груш?
	// 2. Скільки груш ми можемо купити?
	// 3. Скільки яблук ми можемо купити?
	// 4. Чи ми можемо купити 2 груші та 2 яблука?
	//
	// Задача:
	// Опишіть вирішення всіх пунктів задачі використовуючи необхідні змінні чи/та константи.
	// Під опишіть, я маю на увазі наступне:
	// Я маю збілдити ваш код і запустити програму. В результаті цього, я маю побачити роздруковані
	// відповіді на поставлені вище запитання. Перед відповідю треба роздрукувати саме питання.
	// Правильно обирайте типи даних та назви змінних чи констант.
	// Публікація:
	// Створити папку в своєму репозиторії в github та завантажити туди main.go файл, в котрому буде зроблено дане завдання.

	priceApple := 5.99
	pricePear := 7
	allMoney := 23
	fmt.Printf("Маємо усього грошей- %v грн..\nОдне яблуко коштує - %v грн..\nОдна груша коштує - %v грн..\n", allMoney, priceApple, pricePear)
	fmt.Println("--------------------------------------------")

	fmt.Println("Скільки грошей треба витратити, щоб купити 9 яблук та 8 груш?")
	moneyForAppleAndPear := 9*priceApple + float64(8*pricePear)
	fmt.Println("Відповідь -", moneyForAppleAndPear)
	fmt.Println("--------------------------------------------")

	fmt.Println("Скільки груш ми можемо купити?")
	pearForAllMoney := allMoney / pricePear
	fmt.Println("Відповідь -", pearForAllMoney)
	fmt.Println("--------------------------------------------")

	fmt.Println("Скільки яблук ми можемо купити?")
	appleForAllMoney, _ := math.Modf(float64(allMoney) / priceApple)
	fmt.Println("Відповідь -", appleForAllMoney)
	fmt.Println("--------------------------------------------")

	fmt.Println("Чи ми можемо купити 2 груші та 2 яблука?")
	canBayAppleAndPear := (float64(2*pricePear) + 2*priceApple) <= float64(allMoney)
	fmt.Println("Відповідь -", canBayAppleAndPear)
	fmt.Println("--------------------------------------------")

}
